'''
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]'''

products_list = []
y = {}
i=1

for i in range(1,100):
    x = input('хотите добавить эл-нт? если нет, напишите "no", если хотите нажми "Enter":  ')
    if x == "no":
        break
    else:

        y['название'] = input('введите название товара: ')
        y['цена'] = input('цена: ')
        y['количество'] = input('кол-во: ')
        y['ед'] = input('ед.: ')
        s = []
        s.append(i)
        s.append(y.copy())
        products_list.append(tuple(s.copy()))
        print(products_list)


print(products_list)